cmsis-svd/cmsis-svd/data/Infineon/s6e2h1xf.svd
        <!-- REGISTER "IRQ049MON" -->
        <register>
          <name>IRQ049MON</name>
          <description>IRQ049 Batch Read Register</description>
          <addressOffset>0x2C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BMEMCS" -->
            <field>
              <name>BMEMCS</name>
              <description>External bus output error interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ050MON" -->
        <register>
          <name>IRQ050MON</name>
          <description>IRQ050 Batch Read Register</description>
          <addressOffset>0x2CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCINT" -->
            <field>
              <name>RTCINT</name>
              <description>Interrupt request of the RTC$</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ051MON" -->
        <register>
          <name>IRQ051MON</name>
          <description>IRQ051 Batch Read Register</description>
          <addressOffset>0x2D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ052MON" -->
        <register>
          <name>IRQ052MON</name>
          <description>IRQ052 Batch Read Register</description>
          <addressOffset>0x2D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.9</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ053MON" -->
        <register>
          <name>IRQ053MON</name>
          <description>IRQ053 Batch Read Register</description>
          <addressOffset>0x2D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.10</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ054MON" -->
        <register>
          <name>IRQ054MON</name>
          <description>IRQ054 Batch Read Register</description>
          <addressOffset>0x2DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.11</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ055MON" -->
        <register>
          <name>IRQ055MON</name>
          <description>IRQ055 Batch Read Register</description>
          <addressOffset>0x2E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.12</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ056MON" -->
        <register>
          <name>IRQ056MON</name>
          <description>IRQ056 Batch Read Register</description>
          <addressOffset>0x2E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.13</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ057MON" -->
        <register>
          <name>IRQ057MON</name>
          <description>IRQ057 Batch Read Register</description>
          <addressOffset>0x2E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.14</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ058MON" -->
        <register>
          <name>IRQ058MON</name>
          <description>IRQ058 Batch Read Register</description>
          <addressOffset>0x2EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.15</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ059MON" -->
        <register>
          <name>IRQ059MON</name>
          <description>IRQ059 Batch Read Register</description>
          <addressOffset>0x2F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLINT" -->
            <field>
              <name>UPLLINT</name>
              <description>PLL of USB / Ethernet oscillation stabilization wait completion interrupt</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MPLLINT" -->
            <field>
              <name>MPLLINT</name>
              <description>Main PLL oscillation stabilization wait completion interrupt</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SOSCINT" -->
            <field>
              <name>SOSCINT</name>
              <description>Sub clock oscillation stabilization wait completion interrupt</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MOSCINT" -->
            <field>
              <name>MOSCINT</name>
              <description>Main clock oscillation stabilization wait completion interrupt</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ060MON" -->
        <register>
          <name>IRQ060MON</name>
          <description>IRQ060 Batch Read Register</description>
          <addressOffset>0x2F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT0_RX" -->
            <field>
              <name>MFSINT0_RX</name>
              <description>Reception interrupt request of the MFS ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ061MON" -->
        <register>
          <name>IRQ061MON</name>
          <description>IRQ061 Batch Read Register</description>
          <addressOffset>0x2F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT0_STATUS" -->
            <field>
              <name>MFSINT0_STATUS</name>
              <description>Status interrupt request of the MFS ch.0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0_TX" -->
            <field>
              <name>MFSINT0_TX</name>
              <description>Transmission interrupt request of the MFS ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
